snlkuharlocal/src/InformationRegisters/СкидкиНоменклатуры/СкидкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УстановкаСкидок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ЖурналИзмененийЦен/ЖурналИзмененийЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналИзмененийЦен</name>
  <resources>
    <name>СтараяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НоваяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦенСкидок</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СкидкиНоменклатуры/RecordSetModule.bsl
Функция ПолучитьИсходныеСкидки()
	ДанныеВБазе=РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
	
	ДанныеВБазе.Отбор.Документ.Установить(Отбор.Документ.Значение);
	
	Если Отбор.ТипСкидок.Значение<>Неопределено И НЕ Отбор.ТипСкидок.Значение.Пустая() Тогда	
		ДанныеВБазе.Отбор.ТипСкидок.Установить(Отбор.ТипСкидок.Значение);
	КонецЕсли; 
	
	Если Отбор.Номенклатура.Значение<>Неопределено И НЕ Отбор.Номенклатура.Значение.Пустая() Тогда	
		ДанныеВБазе.Отбор.Номенклатура.Установить(Отбор.Номенклатура.Значение);
	КонецЕсли;
	
	Скидки=Новый Соответствие;
	
	ДанныеВБазе.Прочитать();
	Для Каждого Запись Из ДанныеВБазе Цикл
		Скидки.Вставить(Запись.Номенклатура,Запись.Скидка);		
	КонецЦикла;
	
	Возврат Скидки;
КонецФункции // ПолучитьИсходныеЦены()

Процедура ЗаписатьВЖурналИзмененийЦен(Номенклатура,ТипСкидок,СтараяЦена,НоваяЦена,ОбменДанными)
	Запись=РегистрыСведений.ЖурналИзмененийЦен.СоздатьМенеджерЗаписи();
	
	Запись.Дата				=ТекущаяДата();
	Запись.Номенклатура		=Номенклатура;
	Запись.Брэнд			=Номенклатура.Родитель;
	Запись.ТипЦенСкидок		=ТипСкидок;
	Запись.СтараяЦена		=СтараяЦена;
	Запись.НоваяЦена		=НоваяЦена;
	Запись.Пользователь		=ПараметрыСеанса.Пользователь;
	
	Если ОбменДанными.Загрузка Тогда
		Запись.Отправитель		=ОбменДанными.Отправитель;		
		Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
	КонецЕсли;	
	
	Запись.Записать();
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, Замещение)	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	ТипСкидок		= Отбор.ТипСкидок.Значение;
	Если ТипСкидок.Пустая() Тогда	
		ТипСкидок  	= Отбор.Документ.Значение.ТипСкидок;		
	КонецЕсли;
	
	ИсходныеСкидки	=ПолучитьИсходныеСкидки();
	Для Каждого Запись Из ЭтотОбъект Цикл
		ИсходнаяСкидка=ИсходныеСкидки[Запись.Номенклатура];
		ИсходнаяСкидка=?(ИсходнаяСкидка=Неопределено,0,ИсходнаяСкидка);
		
		Если ИсходнаяСкидка<>Запись.Скидка Тогда
			ЗаписатьВЖурналИзмененийЦен(Запись.Номенклатура,ТипСкидок,ИсходнаяСкидка,Запись.Скидка,ОбменДанными);			
		КонецЕсли;		
		ИсходныеСкидки.Удалить(Запись.Номенклатура);
	КонецЦикла; 
	
	Для Каждого ИсходнаяСкидка Из ИсходныеСкидки Цикл
		ЗаписатьВЖурналИзмененийЦен(ИсходнаяСкидка.Ключ,ТипСкидок,ИсходнаяСкидка.Значение,0,ОбменДанными);		
	КонецЦикла; 
	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;			
		
	Если ЗначениеЗаполнено(ТипСкидок) И ТипСкидок.Розничный И ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		//крохин начало 12.10.2016
		//скидки должны грузиться аналогично ценам, только по тем узлам, для которых заведены
		//Выборка=ПланыОбмена.Основной.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	Если Выборка.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
		//		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);		
		//	КонецЕсли;		
		//КонецЦикла;		
		СписокПолучателейСкидок=ПолучитьСписокПолучателейСкидок(ТипСкидок);
		Для Каждого Получатель Из СписокПолучателейСкидок Цикл
			ОбменДанными.Получатели.Добавить(Получатель);
		КонецЦикла;
		//крохин конец 12.10.2016
	КонецЕсли;	
КонецПроцедуры
